{
  "content": [
    {
      "id": 1,
      "title": "Збори кафедри",
      "date": "01.12.2025",
      "time": "14:00",
      "location": "Аудиторія 305",
      "text": "Регулярні планові збори професорсько-викладацького складу кафедри. На порядку денному: обговорення результатів поточного семестру, затвердження тем дипломних робіт та стратегічне планування на наступний навчальний рік. Присутність усіх обов'язкова."
    },
    {
      "id": 2,
      "title": "Консультація",
      "date": "02.12.2025",
      "time": "10:00",
      "location": "Аудиторія 210",
      "text": "Додаткові години консультації викладача з дисципліни «Програмування мікроконтролерів» для студентів 3-го курсу. Можливість розглянути індивідуальні питання по лабораторних роботах та підготовка до модульного контролю."
    },
    {
      "id": 3,
      "title": "День відкритих дверей",
      "date": "21.01.2026",
      "time": "10:00 - 14:00",
      "location": "Головний хол",
      "text": "Запрошуємо абітурієнтів та їх батьків. Ви зможете ознайомитись із навчальними програмами кафедри, поспілкуватись з викладачами та дізнатись про можливості працевлаштування після завершення навчання. Початок презентації о 10:30."
    },
    {
      "id": 4,
      "title": "Семінар",
      "subtitle": "Вступ до квантових обчислень",
      "date": "25.02.2026",
      "time": "16:00",
      "location": "Онлайн (Zoom)",
      "text": "Лектор: Д-р. Іванов, провідний науковий співробітник. Семінар присвячений базовим концепціям квантових комп'ютерів, кубітам та потенційним застосуванням технології. Посилання на конференцію буде надіслано додатково на корпоративні пошти."
    },
    {
      "id": 5,
      "title": "Семінар",
      "subtitle": "Вплив ШІ на наше життя",
      "date": "03.04.2026",
      "time": "15:30",
      "location": "Аудиторія 401",
      "text": "Відкритий семінар для всіх студентів та викладачів. Будуть розглянуті останні тенденції в розвитку нейронних мереж, етичні аспекти застосування штучного інтелекту та його вплив на майбутні професії. Доповідач: доцент С.П. Коваль."
    },
    {
      "id": 6,
      "title": "Зустріч з випускниками",
      "date": "29.05.2026",
      "time": "18:00",
      "location": "Актова зала",
      "text": "Тема: «Кар'єрні шляхи в ІТ: від диплома до успішного стартапу». Ви матимете змогу поспілкуватися з колишніми студентами кафедри, які працюють у провідних ІТ-компаніях, та отримати цінні поради щодо розвитку кар'єри."
    },
    {
      "id": 7,
      "title": "Майстер-клас",
      "subtitle": "Основи кібербезпеки",
      "date": "10.12.2026",
      "time": "17:00",
      "location": "Аудиторія 105",
      "text": "Практичний майстер-клас з освоєння базових навичок захисту даних, налаштування безпечних з'єднань та виявлення поширених загроз. Рекомендовано для студентів 1-2 курсів. Необхідно мати свій ноутбук."
    },
    {
      "id": 8,
      "title": "Кінцевий термін здачі",
      "date": "29.12.2026",
      "time": "23:59",
      "location": "Онлайн (Zoom)",
      "text": "Остаточний кінцевий термін здачі курсових робіт для всіх студентів бакалаврату. Роботи, надіслані після зазначеного часу, не будуть прийняті до розгляду. Переконайтеся, що ви додали всі необхідні додатки та супровідну документацію."
    }
  ]
}
